Revit 2027 API
GlobalParameter.GetValue Method
 Obtains the curent value of the global parameter.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ParameterValue GetValue()
Public Function GetValue As ParameterValue
public:
ParameterValue^ GetValue()
member GetValue : unit -> ParameterValue
Return Value
ParameterValue
 An instance of one of the classes derived from the ParameterValue base class.
Remarks
Note that a value is always returned regardless of whether the parameter is formula-driven, or dimension-driven, or independent.
The returned ParameterValue is casted-up an instance of one of the derived classes, such as DoubleParameterValue or IntegerParameterValue.
See Also
Reference
GlobalParameter Class
Autodesk.Revit.DB Namespace